RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_rtc.c
/**
  ******************************************************************************
  * @file    stm32g4xx_ll_rtc.c
  * @author  MCD Application Team
  * @brief   RTC LL module driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_ll_rtc.h"
#include "stm32g4xx_ll_cortex.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else  /* USE_FULL_ASSERT */
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32G4xx_LL_Driver
  * @{
  */

#if defined(RTC)

/** @addtogroup RTC_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup RTC_LL_Private_Constants
  * @{
  */
/* Default values used for prescaler */
#define RTC_ASYNCH_PRESC_DEFAULT     ((uint32_t) 0x0000007FU)
#define RTC_SYNCH_PRESC_DEFAULT      ((uint32_t) 0x000000FFU)

/* Values used for timeout */
#define RTC_INITMODE_TIMEOUT         ((uint32_t) 1000U) /* 1s when tick set to 1ms */
#define RTC_SYNCHRO_TIMEOUT          ((uint32_t) 1000U) /* 1s when tick set to 1ms */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup RTC_LL_Private_Macros
  * @{
  */
#define IS_LL_RTC_HOURFORMAT(__VALUE__) (((__VALUE__) == LL_RTC_HOURFORMAT_24HOUR) \
                                         || ((__VALUE__) == LL_RTC_HOURFORMAT_AMPM))

#define IS_LL_RTC_ASYNCH_PREDIV(__VALUE__)   ((__VALUE__) <= 0x7FU)

#define IS_LL_RTC_SYNCH_PREDIV(__VALUE__)    ((__VALUE__) <= 0x7FFFU)

#define IS_LL_RTC_FORMAT(__VALUE__) (((__VALUE__) == LL_RTC_FORMAT_BIN) \
                                     || ((__VALUE__) == LL_RTC_FORMAT_BCD))

#define IS_LL_RTC_TIME_FORMAT(__VALUE__) (((__VALUE__) == LL_RTC_TIME_FORMAT_AM_OR_24) \
                                          || ((__VALUE__) == LL_RTC_TIME_FORMAT_PM))

#define IS_LL_RTC_HOUR12(__HOUR__)            (((__HOUR__) > 0U) && ((__HOUR__) <= 12U))
#define IS_LL_RTC_HOUR24(__HOUR__)            ((__HOUR__) <= 23U)
#define IS_LL_RTC_MINUTES(__MINUTES__)        ((__MINUTES__) <= 59U)
#define IS_LL_RTC_SECONDS(__SECONDS__)        ((__SECONDS__) <= 59U)

#define IS_LL_RTC_WEEKDAY(__VALUE__) (((__VALUE__) == LL_RTC_WEEKDAY_MONDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_TUESDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_WEDNESDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_THURSDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_FRIDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_SATURDAY) \
                                      || ((__VALUE__) == LL_RTC_WEEKDAY_SUNDAY))

#define IS_LL_RTC_DAY(__DAY__)    (((__DAY__) >= (uint32_t)1U) && ((__DAY__) <= (uint32_t)31U))

#define IS_LL_RTC_MONTH(__MONTH__) (((__MONTH__) >= 1U) && ((__MONTH__) <= 12U))

#define IS_LL_RTC_YEAR(__YEAR__) ((__YEAR__) <= 99U)

#define IS_LL_RTC_ALMA_MASK(__VALUE__) (((__VALUE__) == LL_RTC_ALMA_MASK_NONE) \
                                        || ((__VALUE__) == LL_RTC_ALMA_MASK_DATEWEEKDAY) \
                                        || ((__VALUE__) == LL_RTC_ALMA_MASK_HOURS) \
                                        || ((__VALUE__) == LL_RTC_ALMA_MASK_MINUTES) \
                                        || ((__VALUE__) == LL_RTC_ALMA_MASK_SECONDS) \
                                        || ((__VALUE__) == LL_RTC_ALMA_MASK_ALL))

#define IS_LL_RTC_ALMB_MASK(__VALUE__) (((__VALUE__) == LL_RTC_ALMB_MASK_NONE) \
                                        || ((__VALUE__) == LL_RTC_ALMB_MASK_DATEWEEKDAY) \
                                        || ((__VALUE__) == LL_RTC_ALMB_MASK_HOURS) \
                                        || ((__VALUE__) == LL_RTC_ALMB_MASK_MINUTES) \
                                        || ((__VALUE__) == LL_RTC_ALMB_MASK_SECONDS) \
                                        || ((__VALUE__) == LL_RTC_ALMB_MASK_ALL))


#define IS_LL_RTC_ALMA_DATE_WEEKDAY_SEL(__SEL__) (((__SEL__) == LL_RTC_ALMA_DATEWEEKDAYSEL_DATE) || \
                                                  ((__SEL__) == LL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY))

#define IS_LL_RTC_ALMB_DATE_WEEKDAY_SEL(__SEL__) (((__SEL__) == LL_RTC_ALMB_DATEWEEKDAYSEL_DATE) || \
                                                  ((__SEL__) == LL_RTC_ALMB_DATEWEEKDAYSEL_WEEKDAY))
/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @addtogroup RTC_LL_Exported_Functions
  * @{
  */

/** @addtogroup RTC_LL_EF_Init
  * @{
  */

/**
  * @brief  De-Initializes the RTC registers to their default reset values.
  * @note   This function does not reset the RTC Clock source and RTC Backup Data
  *         registers.
  * @param  RTCx RTC Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC registers are de-initialized
  *          - ERROR: RTC registers are not de-initialized
  */
ErrorStatus LL_RTC_DeInit(RTC_TypeDef *RTCx)
{
  ErrorStatus status = ERROR;

  /* Check the parameter */
  assert_param(IS_RTC_ALL_INSTANCE(RTCx));
  assert_param(IS_TAMP_ALL_INSTANCE(TAMP));

  /* Disable the write protection for RTC registers */
  LL_RTC_DisableWriteProtection(RTCx);

  /* Set Initialization mode */
  if (LL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    /* Reset TR, DR and CR registers */
    WRITE_REG(RTCx->TR,       0x00000000U);
#if defined(RTC_WAKEUP_SUPPORT)
    WRITE_REG(RTCx->WUTR,     RTC_WUTR_WUT);
#endif /* RTC_WAKEUP_SUPPORT */
    WRITE_REG(RTCx->DR, (RTC_DR_WDU_0 | RTC_DR_MU_0 | RTC_DR_DU_0));
    /* Reset All CR bits except CR[2:0] */
#if defined(RTC_WAKEUP_SUPPORT)
    WRITE_REG(RTCx->CR, (READ_REG(RTCx->CR) & RTC_CR_WUCKSEL));
#else
    WRITE_REG(RTCx->CR, 0x00000000U);
#endif /* RTC_WAKEUP_SUPPORT */
    WRITE_REG(RTCx->PRER, (RTC_PRER_PREDIV_A | RTC_SYNCH_PRESC_DEFAULT));
    WRITE_REG(RTCx->ALRMAR,   0x00000000U);
    WRITE_REG(RTCx->ALRMBR,   0x00000000U);
    WRITE_REG(RTCx->SHIFTR,   0x00000000U);
    WRITE_REG(RTCx->CALR,     0x00000000U);
    WRITE_REG(RTCx->ALRMASSR, 0x00000000U);
    WRITE_REG(RTCx->ALRMBSSR, 0x00000000U);

    /* Exit Initialization mode */
    LL_RTC_DisableInitMode(RTCx);

    /* Wait till the RTC RSF flag is set */
    status = LL_RTC_WaitForSynchro(RTCx);
  }

  /* Enable the write protection for RTC registers */
  LL_RTC_EnableWriteProtection(RTCx);

  /* DeInitialization of the TAMP */
  /* Reset TAMP CR1 and CR2 registers */
  WRITE_REG(TAMP->CR1,      0xFFFF0000U);
  WRITE_REG(TAMP->CR2,     0x00000000U);
#if defined (RTC_OTHER_SUPPORT)
  WRITE_REG(TAMP->CR3,     0x00000000U);
  WRITE_REG(TAMP->SMCR,     0x00000000U);
  WRITE_REG(TAMP->PRIVCR,   0x00000000U);
#endif /* RTC_OTHER_SUPPORT */
  WRITE_REG(TAMP->FLTCR,    0x00000000U);
#if defined (RTC_ACTIVE_TAMPER_SUPPORT)
  WRITE_REG(TAMP->ATCR1,    0x00000000U);
  WRITE_REG(TAMP->ATCR2,    0x00000000U);
#endif /* RTC_ACTIVE_TAMPER_SUPPORT */
  WRITE_REG(TAMP->IER,      0x00000000U);
  WRITE_REG(TAMP->SCR,      0xFFFFFFFFU);
#if defined (RTC_OPTION_REG_SUPPORT)
  WRITE_REG(TAMP->OR,       0x00000000U);
#endif /* RTC_OPTION_REG_SUPPORT */

